InformationRegisters/РезультатыСпециальнойОценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыСпециальнойОценкиУсловийТруда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПлановыеДатыСпециальнойОценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеДатыСпециальнойОценкиУсловийТруда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаБлижайшейОценки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИнструктажиПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИнструктажиПоОхранеТруда</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИнструктажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнструктажейПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскийОсмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПсихиатрическоеОсвидетельствование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыМедицинскогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РезультатыМедицинскогоОсмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИмеетПротивопоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмеетПротивопоказания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыМедицинскогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыМедицинскогоОсмотра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предварительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Периодический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внеплановый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИнструктажПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИнструктажПоОхранеТруда</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИнструктажиПоОхранеТруда</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИнструктажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнструктажейПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НаправлениеНаМедицинскийОсмотр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НаправлениеНаМедицинскийОсмотр</Name>
			<BasedOn>
				<xr:Item>Document.РешениеОПриемеНаРаботу</xr:Item>
				<xr:Item>Document.РешениеОКадровомПереводе</xr:Item>
				<xr:Item>Catalog.Кандидаты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМедицинскогоОсмотра</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециалистПоОхранеТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьСпециалистаПоОхранеТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиСпециалистаПоОхранеТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолисаОМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолисаДМС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторыИВидыРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботМедицинскихОсмотров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/СотрудникиОхранаТруда/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// ЗУПК
	СобытияФормЗУПК.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// ЗУПК
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "СотрудникСсылка");
	
	СотрудникиФормы.ПрочитатьДанныеИзХранилищаВФорму(
		ЭтотОбъект,
		СотрудникиКлиентСервер.ОписаниеДополнительнойФормы(ИмяФормы),
		Параметры.АдресВХранилище);
	
	ПроинициализироватьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ИнструктажПоОхранеТруда" И Параметр.Свойство("ВладелецФормы") И Параметр.ВладелецФормы = ЭтотОбъект Тогда
		ПроинициализироватьФорму();
	КонецЕсли;
	
	ОбработатьОповещениеМедицинскихОсмотров(ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ОбработатьНавигационнуюСсылкуНаправлениеНаМедицинскийОсмотрСоздать(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнструктажиПоОхранеТруда

&НаКлиенте
Процедура ИнструктажиПоОхранеТрудаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ИнструктажиПоОхранеТрудаДействие Тогда
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Организация", Организация);
		ЗначенияЗаполнения.Вставить("ВидИнструктажа", ТекущиеДанные.Инструктаж);
		ЗначенияЗаполнения.Вставить("ДатаПроведения", ОбщегоНазначенияКлиент.ДатаСеанса());
		ЗначенияЗаполнения.Вставить("СписокСотрудников", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СотрудникСсылка));
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.ИнструктажПоОхранеТруда.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Регистратор) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатыСпециальнойОценкиУсловийТруда

&НаКлиенте
Процедура РезультатыСпециальнойОценкиУсловийТрудаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.РезультатыСпециальнойОценкиУсловийТрудаСрокДействия И ЗначениеЗаполнено(ТекущиеДанные.РегистраторСрокДействия) Тогда
		ПоказатьЗначение(,ТекущиеДанные.РегистраторСрокДействия);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Регистратор) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВредныеФакторыИВидыРабот

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВредныеФакторыИВидыРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ТекущиеДанные.Регистратор) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВредныеФакторы

&НаКлиенте
Процедура ВредныеФакторыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВредныеФакторы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ТекущиеДанные.Регистратор) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыРабот

&НаКлиенте
Процедура ВидыРаботВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВидыРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ТекущиеДанные.Регистратор) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСостояниеМедицинскихОсмотров(Команда)
	НачатьОбновлениеПериодическихОсмотров(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроинициализироватьФорму()
	
	Заголовок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникСсылка, "Наименование");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Сотрудник", СотрудникСсылка);
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&Сотрудник КАК Сотрудник,
		|	&ДатаАктуальности КАК Период
		|ПОМЕСТИТЬ ВТСотрудники";
	Запрос.Выполнить();
	
	ОписательВТКадровыеДанные = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудники");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВТКадровыеДанные, Истина, "ФизическоеЛицо, Организация, ДолжностьПоШтатномуРасписанию, РабочееМестоОхраныТруда");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию,
		|	КадровыеДанныеСотрудников.РабочееМестоОхраныТруда КАК РабочееМесто,
		|	КадровыеДанныеСотрудников.ФизическоеЛицо,
		|	КадровыеДанныеСотрудников.Организация
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЦикла;
	
	ЗаполнитьСпециальнуюОценкуУсловийТруда();
	
	ЗаполнитьИнструктажи();
	
	ИнициализироватьМедицинскиеОсмотры();
	
КонецПроцедуры

#Область СпециальнаяОценкаУсловийТруда

&НаСервере
Процедура ЗаполнитьСпециальнуюОценкуУсловийТруда()
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПлановыеДатыСпециальнойОценкиУсловийТруда)
	 Или Не ПолучитьФункциональнуюОпцию("ИспользоватьСпециальнуюОценкуУсловийТруда") Тогда
		Элементы.ГруппаСпецоценка.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто КАК РабочееМесто,
		|	РезультатыСпециальнойОценкиУсловийТруда.КлассУсловийТруда КАК КлассУсловийТруда,
		|	РезультатыСпециальнойОценкиУсловийТруда.Период КАК ДатаПроведения,
		|	РезультатыСпециальнойОценкиУсловийТруда.Регистратор КАК Регистратор,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.ДатаБлижайшейОценки КАК СрокДействия,
		|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Регистратор КАК РегистраторСрокДействия
		|ИЗ
		|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.СрезПоследних(&ДатаАктуальности, РабочееМесто = &РабочееМесто) КАК РезультатыСпециальнойОценкиУсловийТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыСпециальнойОценкиУсловийТруда.СрезПоследних(&ДатаАктуальности, РабочееМесто = &РабочееМесто) КАК ПлановыеДатыСпециальнойОценкиУсловийТруда
		|		ПО РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто = ПлановыеДатыСпециальнойОценкиУсловийТруда.РабочееМесто";
	
	РезультатыСпециальнойОценкиУсловийТруда.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = РезультатыСпециальнойОценкиУсловийТруда.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Инструктажи

&НаСервере
Процедура ЗаполнитьИнструктажи()
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ИнструктажиПоОхранеТруда)
	 Или Не ПолучитьФункциональнуюОпцию("ИспользоватьИнструктажиПоОхранеТруда") Тогда
		Элементы.ГруппаИнструктажиПоОхранеТруда.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", СотрудникСсылка);
	Запрос.УстановитьПараметр("РабочееМесто", ДолжностьПоШтатномуРасписанию);
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ОформитьЗаголовокКоманды", НСтр("ru = 'Оформить'"));
	Запрос.УстановитьПараметр("ПродлитьЗаголовокКоманды", НСтр("ru = 'Продлить'"));
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыИнструктажейПоОхранеТруда.Ссылка КАК Инструктаж,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НЕ ВидыИнструктажейПоОхранеТруда.КонтролироватьПроведениеИнструктажа
		|				ТОГДА ИСТИНА
		|			КОГДА ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест
		|					ИЛИ ВидыИнструктажейПоОхранеТрудаРабочиеМеста.РабочееМесто = &РабочееМесто
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК Используется
		|ПОМЕСТИТЬ ВТВсеИнструктажи
		|ИЗ
		|	Справочник.ВидыИнструктажейПоОхранеТруда КАК ВидыИнструктажейПоОхранеТруда
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыИнструктажейПоОхранеТруда.РабочиеМеста КАК ВидыИнструктажейПоОхранеТрудаРабочиеМеста
		|		ПО ВидыИнструктажейПоОхранеТруда.Ссылка = ВидыИнструктажейПоОхранеТрудаРабочиеМеста.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВидыИнструктажейПоОхранеТруда.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеИнструктажи.Инструктаж КАК Инструктаж,
		|	ИнструктажиПоОхранеТруда.Период КАК ДатаПолучения,
		|	ИнструктажиПоОхранеТруда.Регистратор КАК Регистратор,
		|	ИнструктажиПоОхранеТруда.СрокДействия КАК СрокДействия,
		|	ВЫБОР
		|		КОГДА ИнструктажиПоОхранеТруда.ВидИнструктажа = ЗНАЧЕНИЕ(Справочник.ВидыИнструктажейПоОхранеТруда.Вводный)
		|			ТОГДА """"
		|		КОГДА ИнструктажиПоОхранеТруда.ВидИнструктажа ЕСТЬ NULL
		|			ТОГДА &ОформитьЗаголовокКоманды
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыИнструктажейПоОхранеТруда.ПроводитсяПовторно
		|					ТОГДА &ПродлитьЗаголовокКоманды
		|				ИНАЧЕ &ОформитьЗаголовокКоманды
		|			КОНЕЦ
		|	КОНЕЦ КАК Действие
		|ИЗ
		|	ВТВсеИнструктажи КАК ВсеИнструктажи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыИнструктажейПоОхранеТруда КАК ВидыИнструктажейПоОхранеТруда
		|		ПО ВсеИнструктажи.Инструктаж = ВидыИнструктажейПоОхранеТруда.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнструктажиПоОхранеТруда.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК ИнструктажиПоОхранеТруда
		|		ПО ВсеИнструктажи.Инструктаж = ИнструктажиПоОхранеТруда.ВидИнструктажа
		|ГДЕ
		|	ВсеИнструктажи.Используется";
	
	ИнструктажиПоОхранеТруда.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ИнструктажиПоОхранеТруда.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область МедицинскиеОсмотры

&НаКлиенте
Процедура ОбработатьОповещениеМедицинскихОсмотров(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаправлениеНаМедицинскийОсмотр" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			Если Параметр.Свойство("ФизическоеЛицо") И Параметр["ФизическоеЛицо"] = ФизическоеЛицо Тогда
				ДанныеМедицинскогоСостояния = ДанныеСостояния(ФизическоеЛицо, РабочееМесто,
					ПредопределенноеЗначение("Перечисление.ВидыОбследований.МедицинскийОсмотр"));
				ЗаполнитьСостояниеОсмотраНаКлиенте(ДанныеМедицинскогоСостояния);
				Если ИспользоватьПсихиатрическиеОсвидетельствования Тогда
					ДанныеПсихиатрическогоСостояния = ДанныеСостояния(ФизическоеЛицо, РабочееМесто,
						ПредопределенноеЗначение("Перечисление.ВидыОбследований.ПсихиатрическоеОсвидетельствование"));
					ЗаполнитьСостояниеОсмотраНаКлиенте(
						ДанныеПсихиатрическогоСостояния,
						(Не ДанныеМедицинскогоСостояния.Периодичность.Кратность = 0
						Или ДанныеМедицинскогоСостояния.Периодичность.Однократно));
				Иначе
					Элементы.ПоследнийПсихиатрическоеОсвидетельствование.Видимость = Ложь;
					Элементы.СледующийПсихиатрическоеОсвидетельствование.Видимость = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_ЗаключениеМедицинскогоОсмотра" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			Если Параметр.Свойство("ФизическоеЛицо") И Параметр["ФизическоеЛицо"] = ФизическоеЛицо Тогда
				НачатьОбновлениеПериодическихОсмотров();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_РабочиеМестаОхраныТруда" И Источник = РабочееМесто Тогда
		НачатьОбновлениеПериодическихОсмотров();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьМедицинскиеОсмотры()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскиеОсмотры") Тогда
		Элементы.ГруппаМедицинскиеОсмотры.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		Элементы.ГруппаМедицинскиеОсмотры.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ДобавитьУсловноеОформлениеМедицинскихОсмотров();
	
	ИспользоватьПсихиатрическиеОсвидетельствования = ПолучитьФункциональнуюОпцию(
		"ИспользоватьПсихиатрическиеОсвидетельствования");
	
	ЗаполнитьМедицинскиеОсмотры();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеМедицинскихОсмотров()
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("ВредныеФакторы");
	ИменаТаблиц.Добавить("ВидыРабот");
	ИменаТаблиц.Добавить("ВредныеФакторыИВидыРабот");
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
		// Осмотр фактора не требуется:
		// - серым цветом текст,
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, ИмяТаблицы + ".Требуется", Ложь);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
		ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы);
		// - подпись "Не требуется" в поле "Следующий осмотр".
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, ИмяТаблицы + ".Требуется", Ложь);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не требуется'"));
		ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "СледующийОсмотр");
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, ИмяТаблицы + ".СледующийОсмотр", НачалоДня(ЗарплатаКадрыПериодическиеРегистры.МаксимальнаяДата()));
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не требуется'"));
		ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "СледующийОсмотр");
		// - подпись "Есть противопоказания" в поле "Следующий осмотр".
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, ИмяТаблицы + ".Требуется", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, ИмяТаблицы + ".Результат", Перечисления.РезультатыМедицинскогоОсмотра.ИмеетПротивопоказания);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Есть противопоказания'"));
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СостояниеМедосмотраКритичноеЦветТекста);
		ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "СледующийОсмотр");
		// Благоприятное состояние.
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, ИмяТаблицы + ".Требуется", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, ИмяТаблицы + ".СледующийОсмотр", ДобавитьМесяц(Сегодня, 1), ВидСравненияКомпоновкиДанных.Больше);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СостояниеМедосмотраБлагоприятноеЦветТекста);
		ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "Состояние");
		// Состояние критичное.
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, ИмяТаблицы + ".Требуется", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, ИмяТаблицы + ".СледующийОсмотр", ДобавитьМесяц(Сегодня, 1), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СостояниеМедосмотраКритичноеЦветТекста);
		ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "");
		// Подпись последнего осмотра "Не проводился".
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, ИмяТаблицы + ".ПоследнийОсмотр", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не проводился'"));
		ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "ПоследнийОсмотр");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСостояниеОсмотраНаКлиенте(ДанныеСостояния, ТребуетсяМедОсмотр = Истина)
	
	ЗаполнитьСостояниеОсмотра(
		ЭтотОбъект,
		ОбщегоНазначенияКлиент.ОбщийМодуль("СтроковыеФункцииКлиент"),
		НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()),
		ДанныеСостояния,
		ТребуетсяМедОсмотр);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостояниеОсмотраНаСервере(ДанныеСостояния, ТребуетсяМедОсмотр = Истина)
	
	ЗаполнитьСостояниеОсмотра(
		ЭтотОбъект,
		ОбщегоНазначения.ОбщийМодуль("СтроковыеФункции"),
		НачалоДня(ТекущаяДатаСеанса()),
		ДанныеСостояния,
		ТребуетсяМедОсмотр);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСостояниеОсмотра(Форма, МодульСтроковыеФункции, Сегодня, ДанныеСостояния, ТребуетсяМедОсмотр)
	
	ЗаполнитьИнформациюПоследнегоОсмотра(Форма, МодульСтроковыеФункции, Сегодня, ДанныеСостояния);
	ЗаполнитьИнформациюСледующегоОсмотра(Форма, МодульСтроковыеФункции, Сегодня, ДанныеСостояния, ТребуетсяМедОсмотр);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеСостояния(ФизическоеЛицо, РабочееМесто, ВидОбследования)
	
	ДанныеСостояния = Новый Структура(
		"ПоследнийОсмотр,
		|Периодичность,
		|СледующийОсмотр,
		|ВыданноеНаправление,
		|ВидОбследования,
		|ЭтоМедицинскийОсмотр,
		|ЭтоПсихиатрическийОсмотр,
		|ИмяВидаОбследования");
	
	ДанныеСостояния.ПоследнийОсмотр = МедицинскиеОсмотры.ПоследнийОсмотр(ФизическоеЛицо, РабочееМесто, ВидОбследования);
	ДанныеСостояния.Периодичность = МедицинскиеОсмотры.ПериодичностьМедицинскихОсмотров(РабочееМесто, ВидОбследования);
	ДанныеСостояния.СледующийОсмотр = МедицинскиеОсмотры.СледующийОсмотр(ФизическоеЛицо, РабочееМесто, ВидОбследования);
	ДанныеСостояния.ВыданноеНаправление = МедицинскиеОсмотры.ВыданноеНаправление(ФизическоеЛицо, РабочееМесто, ВидОбследования);
	ДанныеСостояния.ЭтоМедицинскийОсмотр = ВидОбследования = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	ДанныеСостояния.ЭтоПсихиатрическийОсмотр = ВидОбследования = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование;
	ДанныеСостояния.ИмяВидаОбследования = ОбщегоНазначения.ИмяЗначенияПеречисления(ВидОбследования);
	
	Возврат ДанныеСостояния;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьТекущиеДанныеСотрудника(Форма)
	
	Элементы = Форма.Элементы;
	ТекущиеДанныеСотрудника = Элементы.ТекущиеДанныеСотрудника;
	
	ТекущиеДанныеСотрудника.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Текущее рабочее место <a href=""%1"">%2</a> %3'"),
		ПолучитьНавигационнуюСсылку(Форма.РабочееМесто), Строка(Форма.РабочееМесто));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьИнформациюПоследнегоОсмотра(Форма, МодульСтроковыеФункции, Сегодня, ДанныеСостояния)
		
	Элементы = Форма.Элементы;
	ПоследнийОсмотр = ДанныеСостояния.ПоследнийОсмотр;
	ЭлементПоследнийОсмотр = Элементы["Последний" + ДанныеСостояния.ИмяВидаОбследования];
	
	ЭлементПоследнийОсмотр.Заголовок = Неопределено;
	
	Если ПоследнийОсмотр = Неопределено Тогда
		ЭлементПоследнийОсмотр.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ДанныеСостояния.ЭтоМедицинскийОсмотр Тогда
		ТекстНадписи = НСтр("ru = '%1 медицинский осмотр <a href=""%2"">пройден %3</a>'");
	ИначеЕсли ДанныеСостояния.ЭтоПсихиатрическийОсмотр Тогда
		ТекстНадписи = НСтр("ru = '%1 психиатрическое освидетельствование <a href=""%2"">пройдено %3</a>'");
	Иначе
		
	КонецЕсли;
	
	ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстНадписи, ПоследнийОсмотр.ТипОсмотра,
		ПолучитьНавигационнуюСсылку(ПоследнийОсмотр.Регистратор), Формат(ПоследнийОсмотр.Период, "ДЛФ=D"));
	
	Если ПоследнийОсмотр.РезультатОсмотра = ПредопределенноеЗначение(
		"Перечисление.РезультатыМедицинскогоОсмотра.ИмеетПротивопоказания") Тогда
		ТекстКартинки	= "<img src=""Предупреждение"">";
		ТекстКритичный	= НСтр("ru = 'Имеются противопоказания, требуется отстранение от работы'");
		ТекстНадписи	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 %2 <span style=""color: СостояниеМедосмотраКритичноеЦветТекста"">%3</span>'"),
			ТекстНадписи, ТекстКартинки, ТекстКритичный);
	КонецЕсли;
	
	ЭлементПоследнийОсмотр.Заголовок = МодульСтроковыеФункции.ФорматированнаяСтрока(ТекстНадписи);
	ЭлементПоследнийОсмотр.Видимость = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьИнформациюСледующегоОсмотра(Форма, МодульСтроковыеФункции, Сегодня, ДанныеСостояния, ТребуетсяМедОсмотр)

	Элементы = Форма.Элементы;
	Периодичность = ДанныеСостояния.Периодичность;
	СледующийОсмотр = ДанныеСостояния.СледующийОсмотр;
	ВыданноеНаправление = ДанныеСостояния.ВыданноеНаправление;
	ЭлементСледующийОсмотр = Элементы["Следующий" + ДанныеСостояния.ИмяВидаОбследования];
	
	ЭлементСледующийОсмотр.Заголовок = Неопределено;
	
	Если Периодичность.Кратность = 0 И Не Периодичность.Однократно Тогда
		Если Не ТребуетсяМедОсмотр Тогда
			ЭлементСледующийОсмотр.Заголовок =
				НСтр("ru = 'Текущее рабочее место не требует прохождения обязательных медицинских осмотров и психиатрических освидетельствований'");
			Элементы.СледующийМедицинскийОсмотр.Видимость = Ложь;
		ИначеЕсли ДанныеСостояния.ЭтоМедицинскийОсмотр Тогда
			ЭлементСледующийОсмотр.Заголовок =
				НСтр("ru = 'Текущее рабочее место не требует прохождения обязательных медицинских осмотров'");
		ИначеЕсли ДанныеСостояния.ЭтоПсихиатрическийОсмотр Тогда
			ЭлементСледующийОсмотр.Заголовок =
				НСтр("ru = 'Текущее рабочее место не требует прохождения обязательных психиатрических освидетельствований'");
		Иначе
			ЭлементСледующийОсмотр.Заголовок = "";
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если СледующийОсмотр = Неопределено Тогда
		ЭлементСледующийОсмотр.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекстНадписи = "";
	ДатаСледующегоОсмотраПросрочена = СледующийОсмотр.ДатаСледующегоОсмотра < Сегодня;
	Если ДатаСледующегоОсмотраПросрочена Тогда
		Если ДанныеСостояния.ЭтоМедицинскийОсмотр Тогда
			ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Следующий осмотр должен был пройти %1, требуется пройти осмотр немедленно.'"),
				Формат(СледующийОсмотр.ДатаСледующегоОсмотра, "ДЛФ=D"));
		ИначеЕсли ДанныеСостояния.ЭтоПсихиатрическийОсмотр Тогда
			ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Следующее освидетельствование должно было пройти %1, требуется пройти освидетельствование немедленно.'"),
				Формат(СледующийОсмотр.ДатаСледующегоОсмотра, "ДЛФ=D"));
		КонецЕсли;
		ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '<img src=""Предупреждение""> <span style=""color: СостояниеМедосмотраКритичноеЦветТекста"">%1</span>'"),
			ТекстНадписи);
	ИначеЕсли СледующийОсмотр.ДатаСледующегоОсмотра < ДобавитьМесяц(Сегодня, 1) Тогда
		Если ДанныеСостояния.ЭтоМедицинскийОсмотр Тогда
			ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Следующий осмотр должен пройти не позднее %1, осталось меньше месяца.'"),
				Формат(СледующийОсмотр.ДатаСледующегоОсмотра, "ДЛФ=D"));
		ИначеЕсли ДанныеСостояния.ЭтоПсихиатрическийОсмотр Тогда
			ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Следующее освидетельствование должно пройти не позднее %1, осталось меньше месяца.'"),
				Формат(СледующийОсмотр.ДатаСледующегоОсмотра, "ДЛФ=D"));
		КонецЕсли;
		ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '<span style=""color: СостояниеМедосмотраКритичноеЦветТекста"">%1</span>'"), ТекстНадписи);
	Иначе
		Если ДанныеСостояния.ЭтоМедицинскийОсмотр Тогда
			ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Следующий осмотр должен пройти не позднее %1, осталось %2.'"),
				Формат(СледующийОсмотр.ДатаСледующегоОсмотра, "ДЛФ=D"),
				РазностьДатСтрокой(Сегодня, СледующийОсмотр.ДатаСледующегоОсмотра));
		ИначеЕсли ДанныеСостояния.ЭтоПсихиатрическийОсмотр Тогда
			ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Следующее освидетельствование должно пройти не позднее %1, осталось %2.'"),
				Формат(СледующийОсмотр.ДатаСледующегоОсмотра, "ДЛФ=D"),
				РазностьДатСтрокой(Сегодня, СледующийОсмотр.ДатаСледующегоОсмотра));
		КонецЕсли;
	КонецЕсли;
	
	Если ВыданноеНаправление = Неопределено Тогда
		ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 <a href=""%2"">Направить сейчас</a>'"),
			ТекстНадписи,
			ПолучитьНавигационнуюСсылку(ПредопределенноеЗначение("Документ.НаправлениеНаМедицинскийОсмотр.ПустаяСсылка")));
	Иначе
		Если ЗначениеЗаполнено(ВыданноеНаправление.Направление) Тогда
			Если Не ЗначениеЗаполнено(ВыданноеНаправление.Заключение) Тогда
				Если ДанныеСостояния.ЭтоМедицинскийОсмотр Тогда
					ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1 <a href=""%2"">Направлен на медицинский осмотр</a>, заключения пока нет.'"),
						ТекстНадписи,
						ПолучитьНавигационнуюСсылку(ВыданноеНаправление.Направление));
				ИначеЕсли ДанныеСостояния.ЭтоПсихиатрическийОсмотр Тогда
					ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1 <a href=""%2"">Направлен на психиатрическое освидетельствование</a>, заключения пока нет.'"),
						ТекстНадписи,
						ПолучитьНавигационнуюСсылку(ВыданноеНаправление.Направление));
				КонецЕсли;
			Иначе
				ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1 <a href=""%2"">Заключение получено</a>, но документ не проведен.'"),
					ТекстНадписи,
					ПолучитьНавигационнуюСсылку(ВыданноеНаправление.Заключение));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементСледующийОсмотр.Заголовок = МодульСтроковыеФункции.ФорматированнаяСтрока(ТекстНадписи);
	ЭлементСледующийОсмотр.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФакторыМедицинскогоОсмотра()
	
	ВредныеФакторыИВидыРабот.Очистить();
	ОсмотрыПоВреднымФакторамИВидамРабот =
		МедицинскиеОсмотры.ОсмотрыПоВреднымФакторамИВидамРаботФизическогоЛица(ФизическоеЛицо, РабочееМесто);
	Для Каждого СтрокаТаблицы Из ОсмотрыПоВреднымФакторамИВидамРабот Цикл
		НоваяСтрока = ВредныеФакторыИВидыРабот.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Периодичность = СтрокаТаблицы.Периодичность.Представление;
		НоваяСтрока.Состояние = ПредставлениеСостояния(СтрокаТаблицы.СостояниеПроцент);
	КонецЦикла;
	ВредныеФакторыИВидыРабот.Сортировать("Требуется Убыв, СледующийОсмотр Убыв");
	
	ВредныеФакторы.Очистить();
	ОсмотрыПоВреднымФакторам = МедицинскиеОсмотры.ОсмотрыПоВреднымФакторамФизическогоЛица(ФизическоеЛицо, РабочееМесто);
	Для Каждого СтрокаТаблицы Из ОсмотрыПоВреднымФакторам Цикл
		НоваяСтрока = ВредныеФакторы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Периодичность = СтрокаТаблицы.Периодичность.Представление;
		НоваяСтрока.Состояние = ПредставлениеСостояния(СтрокаТаблицы.СостояниеПроцент);
	КонецЦикла;
	ВредныеФакторы.Сортировать("Требуется Убыв, СледующийОсмотр Убыв");
	
	ВидыРабот.Очистить();
	ОсмотрыПоВидамРабот = МедицинскиеОсмотры.ОсмотрыПоВидамРаботФизическогоЛица(ФизическоеЛицо, РабочееМесто);
	Для Каждого СтрокаТаблицы Из ОсмотрыПоВидамРабот Цикл
		НоваяСтрока = ВидыРабот.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Периодичность = СтрокаТаблицы.Периодичность.Представление;
		НоваяСтрока.Состояние = ПредставлениеСостояния(СтрокаТаблицы.СостояниеПроцент);
	КонецЦикла;
	ВидыРабот.Сортировать("Требуется Убыв, СледующийОсмотр Убыв");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНавигационнуюСсылкуНаправлениеНаМедицинскийОсмотрСоздать(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	Если ПолучитьНавигационнуюСсылку(ДокументНаправлениеНаМедицинскийОсмотрПустаяСсылка) <> НавигационнаяСсылкаФорматированнойСтроки Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения");
	ПараметрыФормы.ЗначенияЗаполнения = Новый Структура(
		"ФизическоеЛицо,
		|Организация,
		|ВидОсмотра,
		|ТипОсмотра,
		|РабочееМесто");
	ПараметрыФормы.ЗначенияЗаполнения.ФизическоеЛицо = ФизическоеЛицо;
	ПараметрыФормы.ЗначенияЗаполнения.Организация = Организация;
	ПараметрыФормы.ЗначенияЗаполнения.ТипОсмотра = ПредопределенноеЗначение(
		"Перечисление.ТипыМедицинскогоОсмотра.Периодический");
	ПараметрыФормы.ЗначенияЗаполнения.РабочееМесто = РабочееМесто;

	Если ТекущийЭлемент.Имя = "СледующийМедицинскийОсмотр" Тогда
		ПараметрыФормы.ЗначенияЗаполнения.ВидОсмотра = ПредопределенноеЗначение(
			"Перечисление.ВидыОбследований.МедицинскийОсмотр");
	ИначеЕсли ТекущийЭлемент.Имя = "СледующийПсихиатрическоеОсвидетельствование" Тогда
		ПараметрыФормы.ЗначенияЗаполнения.ВидОсмотра = ПредопределенноеЗначение(
			"Перечисление.ВидыОбследований.ПсихиатрическоеОсвидетельствование");
	КонецЕсли;
	
	ОткрытьФорму("Документ.НаправлениеНаМедицинскийОсмотр.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РазностьДатСтрокой(Знач ДатаНачала, Знач ДатаОкончания)
	
	Возврат ЗарплатаКадрыКлиентСервер.ПредставлениеВременногоИнтервала(ДатаНачала, ДатаОкончания);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеСостояния(СостояниеПроцент)
	
	Представление = "";
	
	МаркерЗаполнен = "●";
	МаркерНеЗаполнен = "○";
	
	ВсегоМаркеров = 5;
	Значение = Окр(СостояниеПроцент * ВсегоМаркеров / 100);
	
	Для НомерМаркера = 1 По ВсегоМаркеров Цикл
		Маркер = МаркерНеЗаполнен;
		Если НомерМаркера <= Значение Тогда
			Маркер = МаркерЗаполнен;
		КонецЕсли;
		Представление = Представление + Маркер;
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции

&НаКлиенте
Процедура НачатьОбновлениеПериодическихОсмотров(ПоказыватьСообщения = Ложь)
	
	ДлительнаяОперация = ОбновитьПериодическиеОсмотрыНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	Если ПоказыватьСообщения Тогда
		ПараметрыОжидания.ВыводитьСообщения = Истина;
	Иначе
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеПериодическихОсмотровЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеПериодическихОсмотровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМедицинскиеОсмотры();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьМедицинскиеОсмотры()
	
	ЗаполнитьТекущиеДанныеСотрудника(ЭтотОбъект);
	ДанныеМедицинскогоСостояния = ДанныеСостояния(
		ФизическоеЛицо,
		РабочееМесто,
		Перечисления.ВидыОбследований.МедицинскийОсмотр);
	ЗаполнитьСостояниеОсмотраНаСервере(ДанныеМедицинскогоСостояния);
	
	Если ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		ДанныеПсихиатрическогоСостояния = ДанныеСостояния(
			ФизическоеЛицо,
			РабочееМесто,
			Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование);
		ЗаполнитьСостояниеОсмотраНаСервере(
			ДанныеПсихиатрическогоСостояния,
			(Не ДанныеМедицинскогоСостояния.Периодичность.Кратность = 0
			Или ДанныеМедицинскогоСостояния.Периодичность.Однократно));
	Иначе
		Элементы.ПоследнийПсихиатрическоеОсвидетельствование.Видимость = Ложь;
		Элементы.СледующийПсихиатрическоеОсвидетельствование.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьФакторыМедицинскогоОсмотра();
	
КонецПроцедуры 

&НаСервере
Функция ОбновитьПериодическиеОсмотрыНаСервере()
	
	ПараметрыПроцедуры = Новый Структура("ФизическиеЛица");
	ПараметрыПроцедуры.ФизическиеЛица = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление сведений о периодических медицинских осмотрах физического лица'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("МедицинскиеОсмотры.ОбновитьПериодическиеОсмотрыФизическихЛицДлительнаяОперация", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

#КонецОбласти

#КонецОбласти
